# ----------------------------------------------------------------------------------------------------
# 设置编译环境相关信息：
# ----------------------------------------------------------------------------------------------------


# ----------------------------------------------------------------------------------------------------
# 设置EPP环境变量：
# ----------------------------------------------------------------------------------------------------

# 添加目标系统环境宏
add_definitions(-DEPP_TARGET_OS_LINUX)

# 添加目标系统位数环境宏
add_definitions(-DEPP_TARGET_OS_64BIT)

# ----------------------------------------------------------------------------------------------------
# 添加需要的头文件包含目录：
# ----------------------------------------------------------------------------------------------------

list(APPEND EPP_INCLUDE_DIRS_LIST
		/usr/include
	 	/usr/include/freetype2
	 )

# ----------------------------------------------------------------------------------------------------
# 添加需要的链接库查询目录：
# ----------------------------------------------------------------------------------------------------

# ----------------------------------------------------------------------------------------------------
# 查找并添加需要的库（对于关系到代码模块化编译的部分，添加相应宏）：
# ----------------------------------------------------------------------------------------------------

add_definitions(-DEPP_TARGET_MODULE_SDL2_SUPPORT)
find_library(lib-sdl2 SDL2)			# libSDL2.so -> lib-sdl2

add_definitions(-DEPP_TARGET_MODULE_X11_SUPPORT)
find_library(lib-x11 X11)			# libX11.so -> lib-x11
find_library(lib-xrender Xrender)	# libXrender.so -> lib-xrender

add_definitions(-DEPP_TARGET_MODULE_FREETYPE2_SUPPORT)
find_library(lib-freetype2 freetype)	# libfreetype.so -> lib-freetype2

# 链接库列表添加项目项目
list(APPEND EPP_LINK_LIBS_LIST
	 ${lib-sdl2}
	 ${lib-x11}
	 ${lib-xrender}
	 ${lib-freetype2}
	 )